app/controllers/chat_rooms_controller.rb

  def index
    @chat_rooms = ChatRoom.all
---
SELECT "chat_rooms".* FROM "chat_rooms"