app/controllers/messages_controller.rb

  def index
    @chat_room = ChatRoom.find(params[:chat_room_id])
    @messages = @chat_room.messages.where('id > ?', params[:after_id].to_i).
      order(:id)
---
SELECT  "chat_rooms".* FROM "chat_rooms" WHERE "chat_rooms"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."chat_room_id" = $1 AND (id > 0) ORDER BY "messages"."id" ASC  [["chat_room_id", 11]]

  def create
    respond_to do |format|
      chat_room = ChatRoom.find(params[:chat_room_id])
---
SELECT  "chat_rooms".* FROM "chat_rooms" WHERE "chat_rooms"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]